In [1]:
import pandas as pd

In [ ]:
df= pd.DataFrame(
    {"nombre":["Juan", "Ronald", "Carla", "Nuria"],
     "edad":[35, 36, 28, 19],
     "dinero":[1_000, 5_000, 500, 1_000_000],
     "soy Nuria":[False, False, False, True]}
    )
df

   nombre  edad   dinero  soy Nuria
0    Juan    35     1000      False
1  Ronald    36     5000      False
2   Carla    28      500      False
3   Nuria    19  1000000       True

# Analizar los datos

In [8]:
df.size

16

In [9]:
df.shape

(4, 4)

In [11]:
df.columns

Index(['nombre', 'edad', 'dinero', 'soy Nuria'], dtype='object')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nombre     4 non-null      object
 1   edad       4 non-null      int64
 2   dinero     4 non-null      int64
 3   soy Nuria  4 non-null      bool
dtypes: bool(1), int64(2), object(1)
memory usage: 232.0+ bytes

In [6]:
df.describe()

            edad          dinero
count   4.000000        4.000000
mean   29.500000   251625.000000
std     7.852813   498920.731012
min    19.000000      500.000000
25%    25.750000      875.000000
50%    31.500000     3000.000000
75%    35.250000   253750.000000
max    36.000000  1000000.000000

In [12]:
df.describe(include="object")

       nombre
count       4
unique      4
top      Juan
freq        1